app/controllers/v1/tasks_controller.rb

    def index
      @tasks = Task.includes(:user).order(created_at: :desc).all
---
SELECT "tasks".* FROM "tasks"  ORDER BY "tasks"."created_at" DESC