app/controllers/v1/tasks_controller.rb

SELECT "tasks".* FROM "tasks"  ORDER BY "tasks"."due_date" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 9, 10, 4, 6, 11)
---
    def index
      @tasks = Task.includes(:user).order(due_date: :asc).all

INSERT INTO "tasks" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
      @task = Task.new(task_params)

      if @task.save